feature/ci cd (#5)
* add cicd pipeline

* cleanup docs and add pipeline monitoring email

* init monitoring module in terraform

* switch acr creds to secrets
